################################################################################
# Editor
################################################################################
export EDITOR='vim'

################################################################################
# Java, Android Studio
################################################################################
export JAVA_HOME="/Applications/Android Studio.app/Contents/jbr/Contents/Home"
export PATH="$JAVA_HOME/bin:$PATH"
export PATH="$HOME/Library/Android/sdk/emulator:$PATH"
export PATH="$HOME/Library/Android/sdk/platform-tools:$PATH"
export PATH="$HOME/Library/Android/sdk/tools/bin:$PATH"

################################################################################
# Homebrew
################################################################################
# エラーになるため、osのコマンドを優先する
export PATH="$PATH:/opt/homebrew/bin"
export PATH="$PATH:/opt/homebrew/sbin"

################################################################################
# gnu make
################################################################################
export PATH="/opt/homebrew/opt/make/libexec/gnubin:$PATH"

################################################################################
# go
################################################################################
export PATH="$HOME/go/bin:$PATH"
# 固定のworktreeを使っており、-trimpath を付けて1つのビルドキャッシュを使いまわすより
# worktreeそれぞれのキャッシュを使ったほうが、キャッシュの差分が小さくなるため
# 増分ビルドが速くなると仮定し、一時的に -trimpath のオプションをオフにする
# export GOFLAGS="-trimpath"
export GOFLAGS=""

################################################################################
# ripgrep
################################################################################
export MANPATH=$HOME/tools/ripgrep/doc/man:$MANPATH
export FPATH=$HOME/tools/ripgrep/complete:$FPATH

################################################################################
# claude
################################################################################
export PATH="$HOME/.claude/scripts:$PATH"

################################################################################
# local
################################################################################
export PATH="$HOME/.local/bin:$PATH"

################################################################################
# GCP
################################################################################
export GOOGLE_CLOUD_PROJECT_ID='erp-server-dev'
