tap "hashicorp/tap"
brew "jpeg-xl"
brew "aom"
brew "aqua"
brew "asdf"
brew "bash"
brew "bat"
brew "gmp"
brew "coreutils"
brew "bats-core"
brew "glib"
brew "colima"
brew "difftastic"
brew "direnv"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc@11"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gemini-cli"
brew "gh"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glances"
brew "gnu-sed"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "go"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "icu4c@77"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "ktlint"
brew "libass"
brew "libmicrohttpd"
brew "libraw"
brew "libressl"
brew "librist"
brew "libsndfile"
brew "lowdown"
brew "lua-language-server"
brew "make"
brew "neovim"
brew "nmap"
brew "openapi-generator"
brew "parallel"
brew "perl"
brew "portaudio"
brew "pstree"
brew "pwgen"
brew "python@3.11"
brew "ripgrep"
brew "ruby-build"
brew "ruff"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vegeta"
brew "wget"
brew "xcodes"
brew "yaml-language-server"
brew "yamllint"
brew "yq"
brew "zbar"
brew "zoxide"
brew "zsh-completions"
brew "hashicorp/tap/terraform"
cask "1password-cli"
cask "alt-tab"
cask "bruno"
cask "claude-code"
cask "docker-desktop"
cask "ghostty"
cask "karabiner-elements"
cask "macfuse"
cask "slack"
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "emeraldwalk.runonsave"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "iliazeus.vscode-ansi"
vscode "janisdd.vscode-edit-csv"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
go "github.com/nametake/go-spanner-ddlstructdiff/cmd/ddlstructdiff"
go "github.com/nametake/fillstruct/cmd/fillstruct"
go "golang.org/dl/go1.26.0"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/nametake/mustargs/cmd/mustargs"
go "github.com/nametake/mustcalls/cmd/mustcalls"
go "github.com/frou/sponge"
