brew "jpeg-xl"
brew "aom"
brew "aqua"
brew "git"
brew "asdf"
brew "ncurses"
brew "bash"
brew "glib"
brew "carthage"
brew "colima"
brew "ctags"
brew "direnv"
brew "fd"
brew "gmp"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "icu4c@77"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "libsndfile"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "gibo"
brew "gnu-sed"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "ktlint"
brew "lua-language-server"
brew "make"
brew "mint"
brew "neovim"
brew "nmap"
brew "openapi-generator"
brew "peco"
brew "portaudio"
brew "python@3.11"
brew "python@3.9"
brew "ripgrep"
brew "ruby-build"
brew "ruff"
brew "sourcery"
brew "swiftformat"
brew "swiftlint"
brew "tig"
brew "tmux"
brew "wget"
brew "xcodes"
brew "yaml-language-server"
brew "yamllint"
brew "yq"
brew "zbar"
brew "zsh-completions"
cask "alacritty"
vscode "42crunch.vscode-openapi"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "iliazeus.vscode-ansi"
vscode "janisdd.vscode-edit-csv"
vscode "koichisasada.vscode-rdbg"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mitchdenny.ecdc"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "rubymaniac.vscode-direnv"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "swiftlang.swift-vscode"
vscode "thadeu.vscode-run-rspec-file"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
