tap "homebrew/bundle"
tap "homebrew/core"
brew "bitrise"
brew "sqlite"
brew "carthage"
brew "direnv"
brew "guile"
brew "gnutls"
brew "ffmpeg"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "graphviz"
brew "imagemagick"
brew "jq"
brew "kotlin"
brew "mint"
brew "oath-toolkit"
brew "openjdk@11"
brew "peco"
brew "rbenv"
brew "ruby"
brew "sourcery"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tig"
brew "tmux"
brew "xcodegen"
brew "zbar"
brew "zsh-completions"
